# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [6,12, 9,18, 12,30]  # P3/8
  - [16,45, 22,60, 24,38]  # P4/16
  - [34,71, 53,96, 107,145]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],    # 0
   [-1, 1, Conv, [128, 3, 2]],  # 1
   [-1, 3, C3, [128]],# 2
   [-1, 1, Conv, [256, 3, 2]],  # 3
   [-1, 6, C3, [256]], #4
   [-1, 1, Conv, [512, 3, 2]],  #5
   [-1, 9, C3, [512]], #6
   [-1, 1, Conv, [1024, 3, 2]],  # 7
   [-1, 3, C3, [1024]], #8
   [-1, 1, SPPF, [1024, 5]],# 9
   [-1, 1, CBAM, [1024]], #10
  ]
# YOLOv5 v6.0 head
head:
  [[-1, 1, GhostConv, [512, 1, 1]], #11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #12
   [6, 1, CBAM, [512]], # 13
   [[-1, 12], 1, Concat, [1]],  # cat backbone 14
   [-1, 3, C3Ghost, [512, False]],  # 15

   [-1, 1, GhostConv, [256, 1, 1]], #16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #17
   [4, 1, CBAM, [256]], #18
   [[-1, 17], 1, Concat, [1]],  # cat backbone P3 19
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C3Ghost, [256, False]],  # 20 (P3/8-small)

   [-1, 1, GhostConv, [256, 3, 2]], #21
   [[-1, 15], 1, Concat, [1]],  # cat head P4 22
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C3Ghost, [512, False]],  # 23 (P4/16-medium)

   [-1, 1, GhostConv, [512, 3, 2]], #24
   [[-1, 11], 1, Concat, [1]],  # cat head P5 25
   [[-1, 8], 1, Concat, [1]],
   [-1, 3, C3Ghost, [1024, False]],  # 26 (P5/32-large)

   [[21, 25, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]